GREETINGS_GUIDE = "어떤 문구가 고민이신가요? 씀씀이와 함께 써봐요!"
WRONG_INPUT = "진행 중인 단계에 맞는 입력이 필요해요."

# (유저 입장에서) 생성 시작 후 확인할 메시지
GENERATE_START = """좋아요! 씀씀이와 함께 카피를 만들어볼까요?
4단계만 거치면 바로 완성돼요!
"""
CHANNEL_GUIDE = "첫번째로, 카피를 담을 채널을 선택해주세요!"

# (유저 입장에서) 채널 선택 후 확인할 메시지
REACTION_TO_CHANNEL = "{channel} 채널로 캠페인을 진행할 계획이시군요!"
PURPOSE_GUIDE = "두번째로는 캠페인의 목적을 선택해주세요."

# (유저 입장에서) 목적 선택 후 확인할 메시지
BACK_TO_CHANNEL = "채널선택으로 다시 돌아왔어요!"
REACTION_TO_PURPOSE = "{purpose} 목적으로 캠페인을 진행하시는군요!"
TARGET_GUIDE = """세번째로, 메시지를 받을 손님에 대해 설명해주세요.

예시)
- 하나대학교 신입생
- 다음달 미국 여행을 준비중인 유학생
- 신용카드 없이 체크카드만 쓰는 20대 후반 직장인
"""

# (유저 입장에서) 타겟 선택 후 확인할 메시지
REACTION_TO_TARGET = "아하! 메시지를 받을 손님에 대해 이해했어요."
DESCRIPTION_GUIDE = """마지막으로, 진행할 캠페인을 구체적으로 말씀해주세요.
손님의 참여 방법, 제공 혜택 등 핵심 포인트를 알려주시면, 씀씀이가 카피에 쓱쓱 반영해드릴게요!

예시)
하나대학교 신입생 대상 학생증 겸 체크카드 발급 이벤트를 진행할거야. 3월에 발급하면 아메리카노 2잔 기프티콘을 제공할거야.
"""

RESTART_GUIDE = "새로운 작업을 시작하시겠어요? 시작하시려면 아래버튼을 눌러주세요! 저장하지 않은 모든 내용은 사라져요."
